dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32-boot-progress
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.esp32.csv"
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_LOG_STREAM_AUTOREGISTER=y
# boot-mode OTA strategy: bb_ota_pull does NOT register /api/update/apply
CONFIG_BB_OTA_STRATEGY_BOOT=y
CONFIG_BB_OTA_BOOT_AUTOREGISTER=y
# Enable the gated boot-progress HTTP + mDNS feature under test
CONFIG_BB_OTA_BOOT_PROGRESS_HTTP=y
CONFIG_BB_BOARD_AUTOREGISTER=y
CONFIG_BB_MANIFEST_AUTOREGISTER=y
CONFIG_BB_OTA_VALIDATOR_AUTOREGISTER=y
CONFIG_BB_WIFI_ROUTES_AUTOREGISTER=y
CONFIG_BB_SYSTEM_ROUTES_AUTOREGISTER=y
CONFIG_BB_OPENAPI_AUTOREGISTER=y
CONFIG_BB_MDNS_AUTOREGISTER=y
CONFIG_BB_EVENT_AUTOREGISTER=y
